


# -----------------------------------------
#  1.  문자열 포맷
name = "홍길동" 
age = 20 
print(f"이름: {name}, 나이: {age}")

print("이름: {}, 나이: {}".format(name, age))

print("이름: %s, 나이: %d" % (name, age))

print("이름:", name, ", 나이:", age) # format 형식 출력 아님


# [1-1]. 문자열 포맷팅
user = "홍길동"
target = "192.168.10.5"
action = "Login Failed"
# [보안알림] 사용자 홍길동가 192.168.10.5 서버에 Login Failed 하였습니다.






# [1-2]. 숫자 포맷팅
age = 25
score = 95
print(f"나이: {age}세")
print(f"점수: {score}점")

# 천 단위 쉼표 표시




# 자릿수지정 : 서버번호-00X




# [1-3]. 실수 포맷팅





#--------------------------------
# 2. 입력받기

# name = input("이름을 입력하세요: ")
# age = int(input("나이를 입력하세요: "))
# print(f"이름: {name}, 나이: {age}")

'''
    [연습문제]
    서버이름(web)과 서버번호(1)를 입력받아 아래와 같이 출력되도록 하세요.

    [출력결과]
    서버: web-0001
'''



#--------------------------------
# 3. 임의의 수



